
  ___  ____  ____  ____  ____ (R)
 /__    /   ____/   /   ____/
___/   /   /___/   /   /___/   15.0   Copyright 1985-2017 StataCorp LLC
  Statistics/Data Analysis            StataCorp
                                      4905 Lakeway Drive
                                      College Station, Texas 77845 USA
                                      800-STATA-PC        http://www.stata.com
                                      979-696-4600        stata@stata.com
                                      979-696-4601 (fax)

2-user Stata network license expires  4 May 2019:
       Serial number:  501509229232
         Licensed to:  Code Ocean
                       New York, NY

Notes:
      1.  Stata is running in batch mode.
      2.  Unicode is supported; see help unicode_advice.

. do 01_stats.do 

. /* 01_stats.do */
. /* Author:  Lars Vilhuber */
. /* quick stats on the input data */
. 
. include "config.do"

. /* config.do */
. /* Suggested by Lars Vilhuber */
. /* Create a reproducible Stata sequence by calling this program from every ot
> her program in your sequence */
. /* Get it at: https://gist.github.com/larsvilhuber/6bcf4ff820285a1f1b9cfff2c8
> 1ca02b */
. /* Usage: 
>   Adapt to your needs, save as config.do, then add
>    include "config.do"
>    in the author's main Stata program
>    */
. 
. /* Create a log file */
. local c_date = c(current_date)

. local cdate = subinstr("`c_date'", " ", "_", .)

. local logprefix "logfile" // could be "myprog" or something else or could com
> e from the main program 

. log using "`logprefix`_`cdate'.log", replace text
-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /root/capsule/code/`logprefix`_30_Apr_2019.log
  log type:  text
 opened on:  30 Apr 2019, 17:47:43

. 
. /* define global parameters and paths */
. global precision 0.01

. 
. /* paths */
. global basepath "/code"      // change this for your specific system

. global inputdata "/data"  // this is where you would read data acquired elsew
> here

. global outputdata "$basepath/outputdata" // this is where you would write the
>  data you create in this project

. global results "$basepath/tables"       // All tables for inclusion in your p
> aper go here

. global programs "$basepath/programs"    // All programs (which you might "inc
> lude") are to be found here

. global adobase  "$basepath/programs/ado" // Ado packages used by the project 
> are to be found here

. 
. /* install any packages locally */
. /* on codeocean, these should go into the post-install script! */
. capture mkdir "$adobase"

. sysdir set PERSONAL "$adobase/ado/personal"

. sysdir set PLUS     "$adobase/ado/plus"

. sysdir set SITE     "$adobase/ado/site"

. 
. 
. 
. /* keep this line in the config file */
. /* It will provide some info about how and when the program was run */
. /* See https://www.stata.com/manuals13/pcreturn.pdf#pcreturn */
. di "=== SYSTEM DIAGNOSTICS ==="
=== SYSTEM DIAGNOSTICS ===

. di "Stata version: `c(stata_version)'"
Stata version: 15

. di "Updated as of: `c(born_date)'"
Updated as of: 20 Jul 2017

. di "Flavor:        `c(flavor)'"
Flavor:        IC

. di "Processors:    `c(processors)'"
Processors:    1

. di "OS:            `c(os)' `c(osdtl)'"
OS:            Unix 

. di "Machine type:  `c(machine_type)'"
Machine type:  PC (64-bit x86-64)

. 
. 
. 
end of do-file
